takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
    UNUSED_PARAMETER(p_context);

    sensor_contact_detected = !sensor_contact_detected;
    ble_hrs_sensor_contact_detected_update(&m_hrs, sensor_contact_detected);
}

static void timer_isr(void * p_context)
{
    //UNUSED_PARAMETER(p_context);
    //NRF_LOG_INFO("timer_isr.");
    
    int32_t ret = 0;

    nrf_drv_gpiote_in_event_disable(BH1792GLC_INT_PIN);

    // became else root, m_bh1792.prm.msr = BH1792_PRM_MSR_SINGLE
    /*
    if (m_bh1792.prm.msr <= BH1792_PRM_MSR_1024HZ) {
      ret = bh1792_SetSync();
      //error_check(ret, "bh1792_SetSync");

      if (m_bh1792.sync_seq < 3) {
        if (m_bh1792.sync_seq == 1) {
          //tmp_eimsk = 0;
        } else {
          ret = bh1792_ClearFifoData();
          //error_check(ret, "bh1792_ClearFifoData");

          //tmp_eimsk = bit(INT0);
        }
      }
    } else {
    */
    
    //m_bh1792.prm.led_cur1 = BH1792_PRM_LED_CUR1_MA(0);
    //m_bh1792.prm.led_cur2 = BH1792_PRM_LED_CUR2_MA(0);
    pw_GetParam(BH1792_PRM_CTRL2_CUR_LED1, &(m_bh1792.prm.led_cur1));
    pw_GetParam(BH1792_PRM_CTRL3_CUR_LED2, &(m_bh1792.prm.led_cur2));
    ret = bh1792_SetParams();
    //ret = bh1792_StartMeasure();
    //error_check(ret, "bh1792_StartMeasure");
    ret = hr_bh1792_StartMeasure();
    //error_check(ret, "hr_bh1792_StartMeasure");

    /*
    }
    */

    nrf_drv_gpiote_in_event_enable(BH1792GLC_INT_PIN, true);
}

/**@brief Function for handling the BH1792GLC measurement timer timeout.
 *
 * @details This function will be called each time BH1792GLC measurement timer expires.
 *
 * @param[in] p_context   Pointer used for passing some arbitrary information (context) from the
 *                        app_start_timer() call to the timeout handler.
 */
static void bh1792glc_meas_timeout_handler(void * p_context)
{
    //NRF_LOG_INFO("bh1792glc measure timer interrupt.");
    timer_isr(p_context);    
}



/**
 * @brief TWI events handler.
 */
void twi_handler(nrf_drv_twi_evt_t const * p_event, void * p_context)
{
    switch(p_event->type)
    {
        case NRF_DRV_TWI_EVT_DONE:
            switch(p_event->xfer_desc.type)
            {
                case NRF_DRV_TWI_XFER_TX:
                    twi_tx_done = true;
                    break;
                case NRF_DRV_TWI_XFER_TXTX:
                    twi_tx_done = true;
                    break;
                case NRF_DRV_TWI_XFER_RX:
                    twi_rx_done = true;
                    //m_xfer_done = true;
                    break;
                case NRF_DRV_TWI_XFER_TXRX:
                    twi_rx_done = true;
                    //m_xfer_done = true;
                    break;
                default:
                    break;
            }
            break;
        case NRF_DRV_TWI_EVT_ADDRESS_NACK:
            break;
        case NRF_DRV_TWI_EVT_DATA_NACK:
            break;
        default:
            break;
    }
}



/**
 * @brief Measurement data record events handler.
 */
#ifndef DEBUG_MEAS_INTERVAL
#define Num_of_data_hr_hr   256
static volatile unsigned int Count_10sec = 59;   // 10 minutes
#else
//for debug setting
#define Num_of_data_hr_hr   32
//for debug setting
static volatile unsigned int Count_10sec = 9;   // 100 seconds
#endif

static volatile unsigned int Meas10sec = 0;
static volatile unsigned int Write_index_data_hr_hr = 0;
static volatile unsigned int Read_index_data_hr_hr = 0;
static volatile unsigned int Count_index_data_hr_hr = 0;
/**@brief record every 10 mintutes, 
 * temprature: 6 points between 10 seconds
 * heart_rate: 60 second average
 */
typedef struct
{
    ble_date_time_t start_time; 
    float body_temperature_array[6];
    uint16_t heart_rate;
} ble_data_ht_hr_t;
static volatile ble_data_ht_hr_t data_hr_hr[Num_of_data_hr_hr] = {};
static volatile ble_data_ht_hr_t temp_data_hr_hr = {};
//static ble_date_time_t time_stamp = { 2019, 2, 28, 23, 59, 50 };

static void meas_data_record_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);

    //NRF_LOG_INFO("10 second interval, it will measurement dara record");

    //  measure 10 seconds, record 10 minutes
    if (Meas10sec < 6)
    {
        //NRF_LOG_INFO("10 second measure, 6 times");
        if (Meas10sec == 0)
        {
            temp_data_hr_hr.start_time.year     = time_stamp.year;
            temp_data_hr_hr.start_time.month    = time_stamp.month;
            temp_data_hr_hr.start_time.day      = time_stamp.day;
            temp_data_hr_hr.start_time.hours    = time_stamp.hours;
            temp_data_hr_hr.start_time.minutes  = time_stamp.minutes;
            temp_data_hr_hr.start_time.seconds  = time_stamp.seconds;

            /*
            if (Count_index_data_hr_hr > Num_of_data_hr_hr - 1)
            {
                Read_index_data_hr_hr = Write_index_data_hr_hr + 1;
                if (Read_index_data_hr_hr > Num_of_data_hr_hr - 1)
                {
                    Read_index_data_hr_hr = Read_index_data_hr_hr - Num_of_data_hr_hr;
                }
            }
            */
        }

        temp_data_hr_hr.body_temperature_array[Meas10sec] = Body_temperature;
        NRF_LOG_INFO("R10sec %d:" NRF_LOG_FLOAT_MARKER "", Meas10sec, NRF_LOG_FLOAT(Body_temperature));
        
        if (Meas10sec == 5)
        {
            //data_hr_hr[Write_index_data_hr_hr].heart_rate = BPM;
            if (Wearing == 1)
            {
              temp_data_hr_hr.heart_rate = Bpm;
            }
            else
            {
              temp_data_hr_hr.heart_rate = CODE_NOT_WEARING;
            }

            data_hr_hr[Write_index_data_hr_hr] = temp_data_hr_hr;

            Write_index_data_hr_hr++;
            if (Write_index_data_hr_hr > Num_of_data_hr_hr - 1)
            {
                //Write_index_data_hr_hr = Write_index_data_hr_hr - Num_of_data_hr_hr;
                Write_index_data_hr_hr = 0;
            }

            Count_index_data_hr_hr++;
            if (Count_index_data_hr_hr > Num_of_data_hr_hr - 1)
            {
                Count_index_data_hr_hr = Num_of_data_hr_hr - 1;
                Read_index_data_hr_hr = Write_index_data_hr_hr + 1;
                //Read_index_data_hr_hr = Write_index_data_hr_hr + 1;
                if (Read_index_data_hr_hr > Num_of_data_hr_hr - 1)
                {
                //    Read_index_data_hr_hr = Read_index_data_hr_hr - Num_of_data_hr_hr;
                    Read_index_data_hr_hr = 0;
                }
                NRF_LOG_INFO("data full:%03d", Count_index_data_hr_hr);
            }
            else
            {
                NRF_LOG_INFO("data increment:%03d", Count_index_data_hr_hr);
            }
            NRF_LOG_INFO("Write: %d", Write_index_data_hr_hr);
            NRF_LOG_INFO("Read: %d", Read_index_data_hr_hr);
            NRF_LOG_INFO("Count: %d", Count_index_data_hr_hr);
            NRF_LOG_FLUSH();
        }
    }

    Meas10sec++;
    if(Meas10sec > Count_10sec)
    {
        Meas10sec = 0;
    }
}

