takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize NUS.
    memset(&nus_init, 0, sizeof(nus_init));

    nus_init.data_handler = nus_data_handler;

    err_code = ble_nus_init(&m_nus, &nus_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Health Thermometer Service
    memset(&hts_init, 0, sizeof(hts_init));

    hts_init.evt_handler                 = on_hts_evt;
    //hts_init.evt_handler                 = NULL;
    hts_init.temp_type_as_characteristic = TEMP_TYPE_AS_CHARACTERISTIC;
    hts_init.temp_type                   = BLE_HTS_TEMP_TYPE_BODY;

    // Here the sec level for the Health Thermometer Service can be changed/increased.
    //hts_init.ht_meas_cccd_wr_sec = SEC_JUST_WORKS;
    hts_init.ht_meas_cccd_wr_sec = SEC_OPEN;
    hts_init.ht_type_rd_sec      = SEC_OPEN;

    err_code = ble_hts_init(&m_hts, &hts_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Heart Rate Service.
    body_sensor_location = BLE_HRS_BODY_SENSOR_LOCATION_FINGER;

    memset(&hrs_init, 0, sizeof(hrs_init));

    hrs_init.evt_handler                 = NULL;
    hrs_init.is_sensor_contact_supported = true;
    hrs_init.p_body_sensor_location      = &body_sensor_location;

    // Here the sec level for the Heart Rate Service can be changed/increased.
    hrs_init.hrm_cccd_wr_sec = SEC_OPEN;
    hrs_init.bsl_rd_sec      = SEC_OPEN;

    err_code = ble_hrs_init(&m_hrs, &hrs_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Battery Service.
    memset(&bas_init, 0, sizeof(bas_init));

    // Here the sec level for the Battery Service can be changed/increased.
    bas_init.bl_rd_sec        = SEC_OPEN;
    bas_init.bl_cccd_wr_sec   = SEC_OPEN;
    bas_init.bl_report_rd_sec = SEC_OPEN;

    bas_init.evt_handler          = NULL;
    bas_init.support_notification = true;
    bas_init.p_report_ref         = NULL;
    bas_init.initial_batt_level   = 100;

    err_code = ble_bas_init(&m_bas, &bas_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Device Information Service.
    memset(&dis_init, 0, sizeof(dis_init));

    ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, MANUFACTURER_NAME);
    //ble_srv_ascii_to_utf8(&dis_init.model_num_str, MODEL_NUM);

    //sys_id.manufacturer_id            = MANUFACTURER_ID;
    //sys_id.organizationally_unique_id = ORG_UNIQUE_ID;
    //dis_init.p_sys_id                 = &sys_id;

    dis_init.dis_char_rd_sec = SEC_OPEN;

    err_code = ble_dis_init(&dis_init);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

static const char * NusCommand[] = 
{
    "sta",    /* 0: start measurement command */
    "sto",    /* 1: stop measurement command  */
    "rqs",    /* 2: request series command    */
    "rqd",    /* 3: request data command      */
    "scd",    /* 4: set current days command  Ex. "scd 2018-12-25" */
    "sct",    /* 5: set current time command  Ex. "sct 12:20:15"   */
    "slp",    /* 6: set sleep enter command */
    "nnn", "nnn", "nnn",     /* 7-9 */
    "nnn", "nnn", "nnn", "nnn", "nnn", "nnn", "nnn", "nnn", "nnn", "nnn",     /* 10-19 */
    "nnn", "nnn", "nnn", "nnn", "nnn", "nnn", "nnn",                          /* 20-26 */
    "dhs",    /* 27: debug heartrate measure start */
    "dhe",    /* 28: debug heartrate measure end  */ 
    "dhg",    /* 29: debug output heartrate */
    "dhr",    /* 30: debug output heart rate command (state change) */
    "dbt",    /* 31: debug output temperature command (state change) */
    "dsp",    /* 32: debug output stop command (state change) */
    "dct",    /* 33: debut output current time */
    "ver",    /* 34: debug output firmware version */
    "dcm",    /* 35: debug Change measurement interval, Count_10sec */
    "dmi",    /* 36: debug output measurement interval, Count_10sec */
    "dba",    /* 37: debug output battery percentage */
    "nnn", "nnn",     /* 38-39 */
};
//uint16_t Number_of_command = 40;
uint16_t Number_of_command = sizeof(NusCommand)/sizeof(char *);

static void sleep_mode_enter();

/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;
        static char com_buf[128] = "";
        uint16_t i;
        uint16_t j;
        uint16_t buf_ind;
        int ind;

        char restime[20] =   ""; //"2018-12-25T12:20:15";
        char resdatanum[4] = "";
        //char respulse[4] =   "";
        char restemp[36] =   ""; //"36.00,36.01,36.02,36.03,36.04,36.05";
        char resdata[128] =  "";

        for (i = 0; i < p_evt->params.rx_data.length; i++)
        {
            do
            {
                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                {
                    NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                    APP_ERROR_CHECK(err_code);
                }
                //NRF_LOG_INFO("string: %c, %d", p_evt->params.rx_data.p_data[i], i);
                com_buf[i] = p_evt->params.rx_data.p_data[i];
            } while (err_code == NRF_ERROR_BUSY);
        }
        if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
        {
            while (app_uart_put('\n') == NRF_ERROR_BUSY);
        }

