takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
        com_buf[p_evt->params.rx_data.length] = '\0';
        //NRF_LOG_INFO("command: %s", (uint8_t)(&com_buf[0]));
        NRF_LOG_INFO("command: %s", p_evt->params.rx_data.p_data);

        uint16_t reslength;
        long temp_year;
        long temp_month;
        long temp_day;
        long temp_hours;
        long temp_minutes;
        long temp_seconds;
        long max_temp_days;
        unsigned int temp_time_interval;

        NRF_LOG_INFO("number of command: %d", Number_of_command);
        for (i = 0; i < Number_of_command; i++)
        {
            if((strncmp(com_buf, NusCommand[i], 3)) == 0)
            {
                switch (i)
                {
                    case 0:   // 0: sta
                        if (State_keeper == STATE_PAIRING)
                        {
                            err_code = app_timer_start(m_bh1792glc_timer_id, BH1792GLC_MEAS_INTERVAL, NULL);
                            APP_ERROR_CHECK(err_code);
                            //nrf_drv_gpiote_in_event_enable(BH1792GLC_INT_PIN, true);

                            err_code = app_timer_start(m_data_record_timer_id, DATA_RECORD_MEAS_INTERVAL, NULL);
                            APP_ERROR_CHECK(err_code);
                            NRF_LOG_INFO("10 second measure and 10 minutes record start");
                            Meas10sec = 0;
                            //Count_index_data_hr_hr = 0;
                            State_keeper = STATE_MEASURING;
                            NRF_LOG_INFO("State_keeper: %d", State_keeper);
                            reslength = 3;
                            err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        }
                        else
                        {
                            NRF_LOG_INFO("already record started");
                            reslength = 3;
                            err_code = ble_nus_data_send(&m_nus, "nak", &reslength, m_conn_handle);                            
                        }
                        break;
                    case 1:   // 1: sto
                        err_code = app_timer_stop(m_bh1792glc_timer_id);
                        APP_ERROR_CHECK(err_code);
                        //nrf_drv_gpiote_in_event_disable(BH1792GLC_INT_PIN);
                        
                        err_code = app_timer_stop(m_data_record_timer_id);
                        APP_ERROR_CHECK(err_code);
                        NRF_LOG_INFO("10 second measure and 10 minutes record stop");
                        if (State_keeper == STATE_MEASURING)
                        {
                            State_keeper = STATE_PAIRING;
                            NRF_LOG_INFO("State_keeper: %d", State_keeper);
                            reslength = 3;
                            err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        }
                        else
                        {
                            reslength = 3;
                            err_code = ble_nus_data_send(&m_nus, "nak", &reslength, m_conn_handle);
                        }
                        break;
                    case 2:   // 2: rqs
                        sprintf(resdatanum, "%03d", Count_index_data_hr_hr);
                        reslength = 3;
                        err_code = ble_nus_data_send(&m_nus, resdatanum, &reslength, m_conn_handle);
                        break;
                    case 3:   // 3: rqd
                        if (Count_index_data_hr_hr > 0)
                        {
                            err_code = app_timer_start(m_data_output_timer_id, DATA_OUTPUT_INTERVAL, NULL);
                            APP_ERROR_CHECK(err_code);
                            NRF_LOG_INFO("data output start");
                            reslength = 3;
                            err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        }
                        else
                        {
                            NRF_LOG_INFO("data output not start, none data");
                            reslength = 3;
                            err_code = ble_nus_data_send(&m_nus, "nak", &reslength, m_conn_handle);
                        }
                        break;
                    case 4:   // 4: scd
                        /* Ex. "scd 2018-01-03" */
                        temp_year =  strtol((const char *)(&com_buf[4]), NULL, 10);
                        temp_month = strtol((const char *)(&com_buf[9]), NULL, 10);
                        temp_day =  strtol((const char *)(&com_buf[12]), NULL, 10);
                        
                        max_temp_days = month_days[temp_month];
                        if (temp_month == 2)
                        {
                            if ((temp_year % 4 == 0 && temp_year % 100 != 0) || (temp_year % 400 == 0)) //leap year
                            {
                                max_temp_days = max_temp_days + 1;
                            }
                        }

                        if ((temp_year >= 1900 && temp_year < 2200) &&
                            (temp_month >= 1 && temp_month < 12) &&
                            (temp_day >= 1 && temp_day <= max_temp_days))
                        {
                          time_stamp.year = temp_year;
                          time_stamp.month = temp_month;
                          time_stamp.day = temp_day;
                          reslength = 3;
                          err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        }
                        else
                        {
                          reslength = 3;
                          err_code = ble_nus_data_send(&m_nus, "nak", &reslength, m_conn_handle);
                        }
                        break;
                    case 5:   // 5: sct
                        /* Ex. "sct 23:59:55" */
                        temp_hours =   strtol((const char *)(&com_buf[4]), NULL, 10);
                        temp_minutes = strtol((const char *)(&com_buf[7]), NULL, 10);
                        temp_seconds = strtol((const char *)(&com_buf[10]), NULL, 10);

