takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
                        if ((temp_hours >= 0 && temp_hours < 24) &&
                            (temp_minutes >= 0 && temp_minutes < 60) &&
                            (temp_seconds >= 0 && temp_seconds < 60))
                        {
                          time_stamp.hours = temp_hours;
                          time_stamp.minutes = temp_minutes;
                          time_stamp.seconds = temp_seconds;
                          reslength = 3;
                          err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        }
                        else
                        {
                          reslength = 3;
                          err_code = ble_nus_data_send(&m_nus, "nak", &reslength, m_conn_handle);
                        }
                        break;
                    case 6:   // 6: slp, set sleep enter command
                        reslength = 3;
                        err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        NRF_LOG_INFO("set sleep, good night");
                        NRF_LOG_FLUSH();
                        sleep_mode_enter();
                        break;
                    case 27:    //dhs, 27: debug heartrate measure start
                        err_code = app_timer_start(m_bh1792glc_timer_id, BH1792GLC_MEAS_INTERVAL, NULL);
                        APP_ERROR_CHECK(err_code);
                        //nrf_drv_gpiote_in_event_enable(BH1792GLC_INT_PIN, true);

                        reslength = 3;
                        err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        break;
                    case 28:    //dhe, 28: debug heartrate measure end
                        err_code = app_timer_stop(m_bh1792glc_timer_id);
                        APP_ERROR_CHECK(err_code);
                        //nrf_drv_gpiote_in_event_disable(BH1792GLC_INT_PIN);

                        reslength = 3;
                        err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        break;
                    case 29:    //dhg, 29: debug output heartrate
                        if (Wearing == 1)
                        {
                            sprintf(resdatanum, "%03d", Bpm);
                        }
                        else
                        {
                            sprintf(resdatanum, "%03d", CODE_NOT_WEARING);
                        }
                        reslength = 3;
                        err_code = ble_nus_data_send(&m_nus, resdatanum, &reslength, m_conn_handle);
                        break;
                    case 30:    // 30: dhr
                        Debug_output_heart_rate = true;
                        Debug_output_body_temperature = false;
                        reslength = 3;
                        err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        break;
                    case 31:    // 31: dbt
                        Debug_output_heart_rate = false;
                        Debug_output_body_temperature = true;
                        reslength = 3;
                        err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        break;
                    case 32:    // 32: dsp
                        Debug_output_heart_rate = false;
                        Debug_output_body_temperature = false;
                        reslength = 3;
                        err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        break;
                    case 33:   // 33: dct
                        //char restime[] =    "2018-12-25T12:20:15";
                        NRF_LOG_INFO("%04d-%02d-%02dT%02d:%02d:%02d", time_stamp.year, time_stamp.month, time_stamp.day, time_stamp.hours, time_stamp.minutes, time_stamp.seconds);
                        sprintf(restime, "%04d-%02d-%02dT%02d:%02d:%02d", time_stamp.year, time_stamp.month, time_stamp.day, time_stamp.hours, time_stamp.minutes, time_stamp.seconds);
                        reslength = strlen(restime);
                        err_code = ble_nus_data_send(&m_nus, &restime[0], &reslength, m_conn_handle);
                        break;
                    case 34:   // 34: ver
                        NRF_LOG_INFO("FIRMWARE_VERSION: %s", FIRMWARE_VERSION);
                        sprintf(resdata, "FIRMWARE_VERSION: %s", FIRMWARE_VERSION);
                        reslength = strlen(resdata);
                        err_code = ble_nus_data_send(&m_nus, &resdata[0], &reslength, m_conn_handle);
                        break;
                    case 35:   //35: "dcm", debug Change measurement interval, Meas10sec
                        /* Ex. "dcm 0060", range: 060 - 990 */
                        temp_time_interval = strtol((const char *)(&com_buf[4]), NULL, 10);
                        NRF_LOG_INFO("SET MEAS INTERVAL: %03d", temp_time_interval);
                        
                        if (temp_time_interval >= 60 && temp_time_interval <= 990)
                        {
                          Count_10sec = temp_time_interval / 10 - 1;
                          reslength = 3;
                          err_code = ble_nus_data_send(&m_nus, "ack", &reslength, m_conn_handle);
                        }
                        else
                        {
                          reslength = 3;
                          err_code = ble_nus_data_send(&m_nus, "nak", &reslength, m_conn_handle);
                        }
                        break;
                    case 36:  //36: "dmi", debug output measurement interval, Meas10sec
                        temp_time_interval = (Count_10sec + 1) * 10;
                        NRF_LOG_INFO("MEAS INTERVAL: %03d", temp_time_interval);
                        sprintf(resdata, "MEAS INTERVAL: %03d", temp_time_interval);
                        reslength = strlen(resdata);
                        err_code = ble_nus_data_send(&m_nus, &resdata[0], &reslength, m_conn_handle);
                        break;
                    case 37: // 37: "dba", debug output battery percentage
                        NRF_LOG_INFO("BAT: " NRF_LOG_FLOAT_MARKER "", NRF_LOG_FLOAT(Battery_percent));
                        sprintf(resdata, "BAT: %03d", (int)(Battery_percent));
                        //sprintf(resdata, "BAT: ", NRF_LOG_FLOAT_MARKER " %", NRF_LOG_FLOAT(Battery_percent));
                        reslength = strlen(resdata);
                        err_code = ble_nus_data_send(&m_nus, &resdata[0], &reslength, m_conn_handle);
                        break;
                    default:
                        break;
                }
                /*
                if ((err_code != NRF_ERROR_INVALID_STATE) &&
                    (err_code != NRF_ERROR_RESOURCES) &&
                    (err_code != NRF_ERROR_NOT_FOUND))
                {
                    APP_ERROR_CHECK(err_code);
                }*/
                break;
            }
            NRF_LOG_INFO("command check done: %d", i);
            NRF_LOG_FLUSH();
        }
        if (i == Number_of_command)
        {
            //NRF_LOG_INFO("nak");
            //NRF_LOG_INFO("Number_of_command: %d", Number_of_command);
            reslength = 3;
            err_code = ble_nus_data_send(&m_nus, "nak", &reslength, m_conn_handle);
            /*
            if ((err_code != NRF_ERROR_INVALID_STATE) &&
                (err_code != NRF_ERROR_RESOURCES) &&
                (err_code != NRF_ERROR_NOT_FOUND))
            {
                APP_ERROR_CHECK(err_code);
            }
            */
        }

        if ((err_code != NRF_ERROR_INVALID_STATE) &&
            (err_code != NRF_ERROR_RESOURCES) &&
            (err_code != NRF_ERROR_NOT_FOUND))
        {
            APP_ERROR_CHECK(err_code);
        }
    }

