takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
            ad_val = (int)p_event->data.done.p_buffer[0];
            ad_voltage = (float)(ad_val + correction_term) / resolution * vcc;
            ad_resistance = (resistance1 * ad_voltage) / (vcc - ad_voltage);
            temperature = b/(logf(ad_resistance/resistance0) + (b/standard_temp)) - 273.15;
            
            if(Debug_output_body_temperature == true)
            {
                NRF_LOG_RAW_INFO("%d," NRF_LOG_FLOAT_MARKER ",", ad_val, NRF_LOG_FLOAT(temperature));
                NRF_LOG_RAW_INFO(NRF_LOG_FLOAT_MARKER "\n", NRF_LOG_FLOAT(ad_voltage));
            }
            Body_temperature = temperature;

            m_adc_channel_enabled = 1;
        }
        else if (m_adc_channel_enabled == 1)    //NRF_SAADC_INPUT_AIN1: P0.03, battery temprature
        {
            err_code = nrf_drv_saadc_channel_uninit(1);
            APP_ERROR_CHECK(err_code);
            err_code = nrf_drv_saadc_channel_init(5, &channel_5_config);
            APP_ERROR_CHECK(err_code);

            err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAMPLES_IN_BUFFER);
            APP_ERROR_CHECK(err_code);
            
            if(Debug_output_battery_temperature == true)
            {
                NRF_LOG_INFO("Channel %d value: %d", m_adc_channel_enabled, p_event->data.done.p_buffer[0]);
            }

            ad_val = (int)p_event->data.done.p_buffer[0];
            ad_voltage = (float)(ad_val + correction_term) / resolution * vcc;
            ad_resistance = (resistance1 * ad_voltage) / (vcc - ad_voltage);
            temperature = b/(logf(ad_resistance/resistance0) + (b/standard_temp)) - 273.15;
            
            if(Debug_output_battery_temperature == true)
            {
                NRF_LOG_RAW_INFO("%d," NRF_LOG_FLOAT_MARKER ",", ad_val, NRF_LOG_FLOAT(temperature));
                NRF_LOG_RAW_INFO(NRF_LOG_FLOAT_MARKER "\n", NRF_LOG_FLOAT(ad_voltage));
            }
            Battery_temperature = temperature;

            if (Battery_temperature > Over_battery_temperature && State_emergency_lock == true)
            {
                //over temprature and sleep mode enter
                NRF_LOG_INFO("sleep mode enter, over temprature");

                err_code = app_timer_stop(m_data_record_timer_id);
                APP_ERROR_CHECK(err_code);
                NRF_LOG_INFO("10 second measure and 10 minutes record stop");
                if (State_keeper == STATE_MEASURING)
                {
                    State_keeper = STATE_PAIRING;
                    NRF_LOG_INFO("State_keeper: %d", State_keeper);
                }

                NRF_LOG_FLUSH();
                sleep_mode_enter();
            }

            if (Battery_temperature > Over_warning_battery_temperature || Battery_temperature < Under_battery_temperature)
            {
                State_keeper = STATE_EMERGENCY;
                State_emergency_lock = true;
            }
            else
            {
                State_emergency_lock = false; 
            }

            m_adc_channel_enabled = 5;
        }
        else if (m_adc_channel_enabled == 5)    //NRF_SAADC_INPUT_AIN5: P0.29, battery voltage
        {
            err_code = nrf_drv_saadc_channel_uninit(5);
            APP_ERROR_CHECK(err_code);
            err_code = nrf_drv_saadc_channel_init(0, &channel_0_config);
            APP_ERROR_CHECK(err_code);

            err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAMPLES_IN_BUFFER);
            APP_ERROR_CHECK(err_code);

            if(Debug_output_battery_voltage == true)
            {
                NRF_LOG_INFO("Channel %d value: %d", m_adc_channel_enabled, p_event->data.done.p_buffer[0]);
            }

            ad_val = (int)p_event->data.done.p_buffer[0];
            ad_voltage = (float)(ad_val) / resolution * vcc;
            bat_voltage = ad_voltage * 2.03;    // 2.03 = 3.98V / 1.96V, measurement, ratio of resistance
            
            if (bat_voltage > 4.10)
            {
                bat_percent = 100;
            }
            else if (bat_voltage < 3.40)
            {
                bat_percent = 1;
            }
            else
            {
                bat_percent = (bat_voltage - 3.40) / 0.70 * 100;    // 0.70 = 4.10 - 3.40, max 4.2 V - min 3.3 V, I found that battery stop 4.05V
            }
            
            if (bat_voltage < 3.25)
            {
                //low battery and sleep mode enter
                NRF_LOG_INFO("sleep mode enter, low battery");

                err_code = app_timer_stop(m_data_record_timer_id);
                APP_ERROR_CHECK(err_code);
                NRF_LOG_INFO("10 second measure and 10 minutes record stop");
                if (State_keeper == STATE_MEASURING)
                {
                    State_keeper = STATE_PAIRING;
                    NRF_LOG_INFO("State_keeper: %d", State_keeper);
                }

                NRF_LOG_FLUSH();
                sleep_mode_enter();
            }

            if(Debug_output_battery_voltage == true)
            {
                NRF_LOG_RAW_INFO("%d," NRF_LOG_FLOAT_MARKER ",", ad_val, NRF_LOG_FLOAT(bat_percent));
                NRF_LOG_RAW_INFO(NRF_LOG_FLOAT_MARKER "\n", NRF_LOG_FLOAT(ad_voltage));
            }
            Battery_percent = bat_percent;

            m_adc_channel_enabled = 0;
        }
    }
}

void saadc_init(void)
{
    ret_code_t err_code;
    /*
    nrf_saadc_channel_config_t channel_config =
        NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN0);    //NRF_SAADC_INPUT_AIN0: P0.02 on nRF52DK board
    */
    //nrf_saadc_channel_config_t channel_config;
    //channel_config = NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN0); 

    err_code = nrf_drv_saadc_init(NULL, saadc_callback);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_channel_init(0, &channel_0_config);
    APP_ERROR_CHECK(err_code);
    m_adc_channel_enabled = 0;

    err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[0], SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);

    //err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[1], SAMPLES_IN_BUFFER);
    //APP_ERROR_CHECK(err_code);
}



void saadc_sampling_event_enable(void)
{
    ret_code_t err_code = nrf_drv_ppi_channel_enable(m_ppi_channel);

    APP_ERROR_CHECK(err_code);
}



/**
 * @brief TWI initialization.
 */
void twi_init (void)
{
    ret_code_t err_code;
    int32_t ret = 0;

    const nrf_drv_twi_config_t twi_bh1792glc_config = {
       .scl                = BH1792GLC_SCL_PIN,
       .sda                = BH1792GLC_SDA_PIN,
       .frequency          = NRF_DRV_TWI_FREQ_400K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = false
    };

    NRF_LOG_INFO("before nrf_drv_twi_init.");
    err_code = nrf_drv_twi_init(&m_twi, &twi_bh1792glc_config, twi_handler, NULL);
    NRF_LOG_INFO("finished nrf_drv_twi_init.");
    APP_ERROR_CHECK(err_code);

    nrf_drv_twi_enable(&m_twi);

    // BH1792
    m_bh1792.fnWrite      = i2c_write;
    m_bh1792.fnRead       = i2c_read;
    ret = bh1792_Reg_Init(&m_bh1792);
    NRF_LOG_INFO("finished bh1792_Reg_Init.");
    //error_check(ret, "bh1792_Reg_Init");

    ret = hr_bh1792_Init();
    NRF_LOG_INFO("finished hr_bh1792_Init.");
    //error_check(ret, "hr_bh1792_Init");

    m_bh1792.prm.sel_adc  = BH1792_PRM_SEL_ADC_GREEN;
    m_bh1792.prm.msr      = BH1792_PRM_MSR_SINGLE;//BH1792_PRM_MSR_1024HZ;
    m_bh1792.prm.led_en   = (BH1792_PRM_LED_EN1_0 << 1) | BH1792_PRM_LED_EN2_0;
    //m_bh1792.prm.led_cur1 = BH1792_PRM_LED_CUR1_MA(1);
    m_bh1792.prm.led_cur1 = BH1792_PRM_LED_CUR1_MA(0);
    m_bh1792.prm.led_cur2 = BH1792_PRM_LED_CUR2_MA(0);
    m_bh1792.prm.ir_th    = 0xFFFC;
    m_bh1792.prm.int_sel  = BH1792_PRM_INT_SEL_SGL;//BH1792_PRM_INT_SEL_WTM;
    NRF_LOG_INFO("before bh1792_SetParams.");
    ret = bh1792_SetParams();
    //error_check(ret, "bh1792_SetParams");
    NRF_LOG_INFO("finished bh1792_SetParams.");

    //NRF_LOG_INFO("GDATA(@LED_ON),GDATA(@LED_OFF)\n");

    //ret = bh1792_StartMeasure();
    //error_check(ret, "bh1792_StartMeasure");
    //NRF_LOG_INFO("finished bh1792_StartMeasure.");

    ret = hr_bh1792_StartMeasure();
    //error_check(ret, "hr_bh1792_StartMeasure");
    NRF_LOG_INFO("finished Hr_bh1792_StartMeasure.");

    //ret = bh1792_StopMeasure();
    //error_check(ret, "bh1792_StopMeasure");
    //NRF_LOG_INFO("finished bh1792_StopMeasure.");
}



void bh1792_isr(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    int32_t ret = 0;
    //uint8_t i   = 0;
    u16_pair_t s_pwData_test;
    float32_t pw_test;
    //static uint8_t  bpm     = 0U;
    //static uint8_t  wearing = 0U;
    static uint8_t    s_cnt_freq = 0;

    nrf_drv_gpiote_in_event_disable(BH1792GLC_INT_PIN);

    //ret = bh1792_GetMeasData(&m_bh1792_dat);
    //error_check(ret, "bh1792_GetMeasData");
    //ret = hr_bh1792_Calc(s_cnt_freq);
    //s_pwData_test = m_bh1792_dat.green;
    ret = hr_bh1792_Calc(s_cnt_freq, &m_bh1792_dat, &s_pwData_test, &pw_test);
    s_cnt_freq++;
    if (s_cnt_freq >= 31)
    {
        s_cnt_freq = 0;
        hr_bh1792_GetData(&Bpm, &Wearing);
        //NRF_LOG_RAW_INFO("%d, %d\n", bpm, wearing);
        NRF_LOG_RAW_INFO("%d, %d, %d, %d, ", Bpm, Wearing, s_pwData_test.on, s_pwData_test.off);
        NRF_LOG_RAW_INFO("" NRF_LOG_FLOAT_MARKER "\n", NRF_LOG_FLOAT(pw_test));
    }
    //NRF_LOG_RAW_INFO("%d, %d, %d, %d, ", bpm, wearing, s_pwData_test.on, s_pwData_test.off);
    //NRF_LOG_RAW_INFO("" NRF_LOG_FLOAT_MARKER "\n", NRF_LOG_FLOAT(pw_test));

    //ret = hr_bh1792_Calc(s_cnt_freq, &s_pwData_test, &pw_test);
    //error_check(ret, "hr_bh1792_Calc");

    // became else root, m_bh1792.prm.msr = BH1792_PRM_MSR_SINGLE
    /*
    if(m_bh1792.prm.msr <= BH1792_PRM_MSR_1024HZ) {
      for (i = 0; i < m_bh1792_dat.fifo_lev; i++) {
        NRF_LOG_INFO("%d", m_bh1792_dat.fifo[i].on);
        NRF_LOG_INFO(",");
        NRF_LOG_INFO("%d\n", m_bh1792_dat.fifo[i].off);
      }
    } else {
      if(m_bh1792.prm.sel_adc == BH1792_PRM_SEL_ADC_GREEN) {
        */
        //NRF_LOG_RAW_INFO("%d,%d,%d,%d\n", m_bh1792_dat.green.on, m_bh1792_dat.green.off, m_bh1792_dat.ir.on, m_bh1792_dat.ir.off)
                
