takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
        Tick_count++;
        if (Tick_count > 9)
        {
            Tick_count = 0;
        }
    }
}

const nrf_drv_rtc_t rtc = NRF_DRV_RTC_INSTANCE(2); /**< Declaring an instance of nrf_drv_rtc for RTC2. */
/** @brief Function initialization and configuration of RTC driver instance.
 */
static void rtc_config(void)
{
    uint32_t err_code;

    //Initialize RTC instance
    nrf_drv_rtc_config_t config = NRF_DRV_RTC_DEFAULT_CONFIG;
    config.prescaler = 4095;
    err_code = nrf_drv_rtc_init(&rtc, &config, rtc_handler);
    APP_ERROR_CHECK(err_code);

    //Enable tick event & interrupt
    nrf_drv_rtc_tick_enable(&rtc, true);

    //Power on RTC instance
    nrf_drv_rtc_enable(&rtc);
}



/**@brief Function for starting application timers.
 */
static void application_timers_start(void)
{
    ret_code_t err_code;

    // Start application timers.
    err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_heart_rate_timer_id, HEART_RATE_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_rr_interval_timer_id, RR_INTERVAL_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_temperature_timer_id, TEMPERATURE_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_sensor_contact_timer_id, SENSOR_CONTACT_DETECTED_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

#ifndef TWI_DISABLE
    //err_code = app_timer_start(m_bh1792glc_timer_id, BH1792GLC_MEAS_INTERVAL, NULL);
    //APP_ERROR_CHECK(err_code);
#endif

    //err_code = app_timer_start(m_data_record_timer_id, DATA_RECORD_MEAS_INTERVAL, NULL);
    //APP_ERROR_CHECK(err_code);
}



/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        uint32_t err_code;
        err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);
    }
}



/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    //UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
    //nrf_pwr_mgmt_run();
    /*
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
    */
    do
    {
        //__WFE();
        nrf_pwr_mgmt_run();
    }while (m_xfer_done == false);
    NRF_LOG_FLUSH();
    m_xfer_done = false;
}



static void print_flash_info(nrf_fstorage_t * p_fstorage)
{
    NRF_LOG_INFO("========| flash info |========");
    NRF_LOG_INFO("erase unit: \t%d bytes",      p_fstorage->p_flash_info->erase_unit);
    NRF_LOG_INFO("program unit: \t%d bytes",    p_fstorage->p_flash_info->program_unit);
    NRF_LOG_INFO("==============================");
}

void wait_for_flash_ready(nrf_fstorage_t const * p_fstorage)
{
    /* While fstorage is busy, sleep and wait for an event. */
    while (nrf_fstorage_is_busy(p_fstorage))
    {
        //power_manage();
        //sd_app_evt_wait();
        nrf_pwr_mgmt_run();
    }
}






/**@brief Application main function.
 */
int main(void)
  {
    bool erase_bonds;

    // Initialize.
    State_keeper = STATE_BOOTING;
    Boot_count = 0;
    log_init();
    uart_init();
    NRF_LOG_INFO("Finish uart init, log init");
    lfclk_request();
    gpio_init();
    NRF_LOG_INFO("Finish gpio init");;
    timers_init();
    NRF_LOG_INFO("Finish timers init");    
    buttons_leds_init(&erase_bonds);
    NRF_LOG_INFO("Finish buttons leds init");
    power_management_init();
    NRF_LOG_INFO("Finish power management init");
    ble_stack_init();
    NRF_LOG_INFO("Finish ble stack init");
    gap_params_init();
    NRF_LOG_INFO("Finish gap params init");
    gatt_init();
    NRF_LOG_INFO("Finish gatt init");
    services_init();
    NRF_LOG_INFO("Finish services init");
    advertising_init();
    NRF_LOG_INFO("Finish advertising init");
    sensor_simulator_init();
    NRF_LOG_INFO("Finish sensor simulator init");
    conn_params_init();
    NRF_LOG_INFO("Finish conn params init");
    peer_manager_init();
    NRF_LOG_INFO("Finish saadc_init init");
    saadc_sampling_event_init();
    NRF_LOG_INFO("Finish peer manager init");
    saadc_init();
    NRF_LOG_INFO("Finish saadc_sampling_event_init init");
    saadc_sampling_event_enable();
    NRF_LOG_INFO("SAADC HAL simple example started.");

#ifndef TWI_DISABLE
    NRF_LOG_INFO("TWI sensor example started.");
    NRF_LOG_FLUSH();
    twi_init();
    NRF_LOG_INFO("finished twi init.");
#endif

    rtc_config();
    NRF_LOG_INFO("finished rtc config.")

    ret_code_t rc;
    NRF_LOG_INFO("fstorage example started.");
    nrf_fstorage_api_t * p_fs_api;
    NRF_LOG_INFO("SoftDevice is present.");
    NRF_LOG_INFO("Initializing nrf_fstorage_sd implementation...");
    /* Initialize an fstorage instance using the nrf_fstorage_sd backend.
     * nrf_fstorage_sd uses the SoftDevice to write to flash. This implementation can safely be
     * used whenever there is a SoftDevice, regardless of its status (enabled/disabled). */
    p_fs_api = &nrf_fstorage_sd;
    rc = nrf_fstorage_init(&fstorage, p_fs_api, NULL);
    APP_ERROR_CHECK(rc);
    print_flash_info(&fstorage);
    /* It is possible to set the start and end addresses of an fstorage instance at runtime.
     * They can be set multiple times, should it be needed. The helper function below can
     * be used to determine the last address on the last page of flash memory available to
     * store data. */
    (void) nrf5_flash_end_addr_get();

    /* Let's write to flash. */
    /*
    uint32_t test_write_address = 0x60000;
    NRF_LOG_INFO("Writing \"%x\" to flash.", m_data);
    rc = nrf_fstorage_write(&fstorage, test_write_address, &m_data, sizeof(m_data), NULL);
    APP_ERROR_CHECK(rc);

    wait_for_flash_ready(&fstorage);
    NRF_LOG_INFO("Done.");

    uint8_t    data[256] = {0};

    rc = nrf_fstorage_read(&fstorage, test_write_address, data, 8);
    if (rc != NRF_SUCCESS)
    {
        NRF_LOG_INFO("nrf_fstorage_read() returned: %s\n", nrf_strerror_get(rc));
    }

    for (uint32_t i = 0; i < 8; i++)
    {
        NRF_LOG_INFO("0x%x ", data[i]);
    }
    */

