takurx/nRF5_test_ble_app_nus_and_hts_and_hrs_with_saadc_twi-bh1792glc/examples/ble_peripheral/ble_app_uart/main.c
    uint32_t i = 0;
    uint32_t read_address = Flash_start_address;
    static uint8_t read_data[sizeof(data_hr_hr[0])];

    for (i = 0; i <  Num_of_data_hr_hr; i++)
    {
        rc = nrf_fstorage_read(&fstorage, read_address, read_data, sizeof(read_data));
        if (rc != NRF_SUCCESS)
        {
            NRF_LOG_INFO("nrf_fstorage_read() returned: %s\n", nrf_strerror_get(rc));
        }
        data_hr_hr[i] = *(ble_data_ht_hr_t *)(read_data);
        NRF_LOG_INFO("Read done, %d, 0x%x", i, read_address);
        NRF_LOG_FLUSH();
        read_address = read_address + sizeof(read_data);
    }

    //Current time, time_stamp
    static uint8_t read_time_stamp[sizeof(time_stamp)];
    rc = nrf_fstorage_read(&fstorage, read_address, read_time_stamp, sizeof(read_time_stamp));
    if (rc != NRF_SUCCESS)
    {
        NRF_LOG_INFO("nrf_fstorage_read() returned: %s\n", nrf_strerror_get(rc));
    }
    //time_stamp = *(ble_date_time_t *)(read_time_stamp);
    volatile ble_date_time_t temp_stamp = *(ble_date_time_t *)(read_time_stamp);
    if (temp_stamp.year > 1900 && temp_stamp.year < 2200)
    {
        time_stamp.year = temp_stamp.year;
    }
    else
    {
        NRF_LOG_INFO("Read error: year, %d", temp_stamp.year);
    }
    if (temp_stamp.month > 0 && temp_stamp.month < 13)
    {
        time_stamp.month = temp_stamp.month;
    }
    else
    {
        NRF_LOG_INFO("Read error: month, %d", temp_stamp.month);
    }
    if (temp_stamp.day > 0 && temp_stamp.day < 32)
    {
        time_stamp.day = temp_stamp.day;
    }
    else
    {
        NRF_LOG_INFO("Read error: day, %d", temp_stamp.day);
    }
    if (temp_stamp.hours < 24)
    {
        time_stamp.hours = temp_stamp.hours;
    }
    else
    {
        NRF_LOG_INFO("Read error: hours, %d", temp_stamp.hours);
    }
    if (temp_stamp.minutes < 60)
    {
        time_stamp.minutes = temp_stamp.minutes;
    }
    else
    {
        NRF_LOG_INFO("Read error: minutes, %d", temp_stamp.minutes);
    }
    if (temp_stamp.seconds < 60)
    {
        time_stamp.seconds = temp_stamp.seconds;
    }
    else
    {
        NRF_LOG_INFO("Read error: seconds, %d", temp_stamp.seconds);
    }
    NRF_LOG_INFO("%04d-%02d-%02dT%02d:%02d:%02d", time_stamp.year, time_stamp.month, time_stamp.day, time_stamp.hours, time_stamp.minutes, time_stamp.seconds);
    NRF_LOG_INFO("Read done, 0x%x", read_address);
    NRF_LOG_FLUSH();
    read_address = read_address + sizeof(read_time_stamp);

    //Write index, Write_index_data_hr_hr
    static uint8_t read_write_index[sizeof(Write_index_data_hr_hr)];
    rc = nrf_fstorage_read(&fstorage, read_address, read_write_index, sizeof(read_write_index));
    if (rc != NRF_SUCCESS)
    {
        NRF_LOG_INFO("nrf_fstorage_read() returned: %s\n", nrf_strerror_get(rc));
    }
    volatile unsigned int temp_Write_index_data_hr_hr = *(unsigned int *)(read_write_index);
    if (temp_Write_index_data_hr_hr < Num_of_data_hr_hr)
    {
        Write_index_data_hr_hr = temp_Write_index_data_hr_hr;
    }
    else
    {
        Write_index_data_hr_hr = 0;
    }
    NRF_LOG_INFO("Read done, 0x%x", read_address);
    NRF_LOG_FLUSH();
    read_address = read_address + sizeof(read_write_index);

    //Read index, Read_index_data_hr_hr
    static uint8_t read_read_index[sizeof(Read_index_data_hr_hr)];
    rc = nrf_fstorage_read(&fstorage, read_address, read_read_index, sizeof(read_read_index));
    if (rc != NRF_SUCCESS)
    {
        NRF_LOG_INFO("nrf_fstorage_read() returned: %s\n", nrf_strerror_get(rc));
    }
    volatile unsigned int temp_Read_index_data_hr_hr = *(unsigned int *)(read_read_index);
    if (temp_Read_index_data_hr_hr < Num_of_data_hr_hr)
    {
        Read_index_data_hr_hr = temp_Read_index_data_hr_hr;
    }
    else
    {
        Read_index_data_hr_hr = 0;
    }
    NRF_LOG_INFO("Read done, 0x%x", read_address);
    NRF_LOG_FLUSH();
    read_address = read_address + sizeof(read_read_index);

    //Count index, Count_index_data_hr_hr
    static uint8_t read_count_index[sizeof(Count_index_data_hr_hr)];
    rc = nrf_fstorage_read(&fstorage, read_address, read_count_index, sizeof(read_count_index));
    if (rc != NRF_SUCCESS)
    {
        NRF_LOG_INFO("nrf_fstorage_read() returned: %s\n", nrf_strerror_get(rc));
    }
    volatile unsigned int temp_Count_index_data_hr_hr = *(unsigned int *)(read_count_index);
    if (temp_Count_index_data_hr_hr <= Num_of_data_hr_hr)
    {
        Count_index_data_hr_hr = temp_Count_index_data_hr_hr;
    }
    else
    {
        Count_index_data_hr_hr = 0;
    }
    NRF_LOG_INFO("temp Count index : 0x%x", temp_Count_index_data_hr_hr);
    NRF_LOG_INFO("Read done, 0x%x", read_address);
    NRF_LOG_FLUSH();
    read_address = read_address + sizeof(read_count_index);

    NRF_LOG_INFO("==============================");
    NRF_LOG_INFO("Write index: %d", Write_index_data_hr_hr);
    NRF_LOG_INFO("Read index : %d", Read_index_data_hr_hr);
    NRF_LOG_INFO("Count index: %d", Count_index_data_hr_hr);
    NRF_LOG_INFO("==============================");

    //flash erase
    uint32_t erase_address = Flash_start_address;
    uint32_t pages_cnt = 3;
    rc = nrf_fstorage_erase(&fstorage, erase_address, pages_cnt, NULL);
    if (rc != NRF_SUCCESS)
    {
        NRF_LOG_INFO("nrf_fstorage_erase() returned: %s\n", nrf_strerror_get(rc));
    }

    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    NRF_LOG_INFO("Heart Rate Sensor example started.");
    NRF_LOG_INFO("Health Thermometer example started.");

    application_timers_start();
    //NRF_LOG_FLUSH();

    /*
    nrf_drv_gpiote_in_event_disable(BH1792GLC_INT_PIN);
    ret_code_t err_code;
    err_code = app_timer_stop(m_bh1792glc_timer_id);
    APP_ERROR_CHECK(err_code);
    int32_t ret = 0;
    ret = bh1792_StopMeasure();
    error_check(ret, "bh1792_StopMeasure");
    NRF_LOG_INFO("finished bh1792_StopMeasure.");
    */

    advertising_start(erase_bonds);
    State_keeper = STATE_ADVERTISING;
    //NRF_LOG_FLUSH();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
